### <span id="idx">Index</span>

### <a href="#one" target="_self"> 1 </a>How to create a DataFrame in Pandas? <br />
<span style="padding-left:30px">a.<a href="#s1" target="_self">Using Lists</a>        <span ><br />
<span style="padding-left:50px">  <a href="#t1" target="_self">Task1</a>              <span ><br /> 
<span style="padding-left:30px">b.<a href="#s2" target="_self">Using Dictionaries</a><span ><br />
<span style="padding-left:50px">  <a href="#t2" target="_self">Task2</a>              <span ><br /> 
<span style="padding-left:30px">c.<a href="#s3" target="_self">Using Numpy array</a>  <span ><br />
<span style="padding-left:50px">  <a href="#t3" target="_self">Task3</a>              <span ><br /> 
<span style="padding-left:30px">d.<a href="#s4" target="_self">Read csv into DataFrame</a>  <span ><br />
<span style="padding-left:50px">  <a href="#t4" target="_self">Task4</a>              <span ><br />
<span style="padding-left:30px">e.<a href="#s5" target="_self">From SQLite Databases </a>  <span ><br />
<span style="padding-left:50px">  <a href="#t5" target="_self">Task5</a> <span ><br />     
<span style="padding-left:30px">f.<a href="#s6" target="_self">From a JSON File </a>  <span ><br />
<span style="padding-left:50px">  <a href="#t6" target="_self">Task6</a>              <span ><br /> 
<span style="padding-left:30px">g.<a href="#s7" target="_self">Combine series to form a DF </a>  <span ><br />
<span style="padding-left:50px">  <a href="#t7" target="_self">Task7</a>              <span ><br />       
    
### <a href="#two" target="_self"> 2 </a>How to iterate over Pandas Rows? <br />

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

<a href='#t1' target="_self">Task1 </a> Create a dataframe with four favourite programming language of yours <br />

In [2]:
import os

<a href="#idx" target="_self" style="position:fixed">Index</a>

### <span id="one"> How to create a DataFrame in Pandas? </span>
<span id="s1"> 1. Data being used here to create a dataframe is in the form of a <b> list </b>.Â¶

In [3]:
data = [[1,2013,'ar00001','Thailand',157500],
       [2,2014,'ar00002','Russia',458226],
       [3,2012,'ar00003','South Korea',787954],
       [4,2010,'ar00004','India',456312],
       [5,2018,'ar00005','England',235485]]

In [4]:
type(data)

list

In [5]:
df = pd.DataFrame(data,columns=['SNO','Year','ID','Country','Sales'])

In [6]:
df.head()

   SNO  Year       ID      Country   Sales
0    1  2013  ar00001     Thailand  157500
1    2  2014  ar00002       Russia  458226
2    3  2012  ar00003  South Korea  787954
3    4  2010  ar00004        India  456312
4    5  2018  ar00005      England  235485

In [7]:
df.dtypes

SNO         int64
Year        int64
ID         object
Country    object
Sales       int64
dtype: object

#### <span style="color:red" id="t1">Task </span>
Create a dataframe with four favourite programming language of yours .

1st Column - Name of Progamming Lanuage(Name of PL) <br />
2nd Column - Frequency of usage(Frequency) Labels:(Less Frequent, Frequent, More-Frequent)  <br />
3rd Column - Skill Level(Labels: Beginner, Intermediate, Expert)  <br />
4th Column - Real-time exposure (Labels : Yes, No)  <br />

In [8]:
data=[['C','Less Frequent','Beginner','No'],
      ['Java','Frequent','Expert','Yes'],
      ['Python','Frequent','Intermediate','Yes'],
     ['R','Less Frequent','Beginner','No'],
     ]
languages = pd.DataFrame(data,columns=['PL','Usage','Level','Exposure'])
languages

       PL          Usage         Level Exposure
0       C  Less Frequent      Beginner       No
1    Java       Frequent        Expert      Yes
2  Python       Frequent  Intermediate      Yes
3       R  Less Frequent      Beginner       No

<a href="#idx" target="_self">Index </a>
### <span id="s2"> Creating a dataframe from Dictionary object by columns or by index allowing dtype specification </span>

In [9]:
dic = {'a':[1,2,7],'b':[3,4,6]}
df_dic = pd.DataFrame(dic)
df_dic

   a  b
0  1  3
1  2  4
2  7  6

#### <span style="color:red" id="t2">Task 2</span>
Create a dictionary called "accessories". Consider atleast 4-5 favourite accessories of yours and make them as key, while the cost of it as values. Upon creating the dictionary, map it to a dataframe.

In [10]:
price_dic = {'Name':['Laptop','Mobile','IPod','TV','HeadPhones'],'price':[50000,20000,8000,80000,4000]}
accessories = pd.DataFrame(price_dic)
accessories

         Name  price
0      Laptop  50000
1      Mobile  20000
2        IPod   8000
3          TV  80000
4  HeadPhones   4000

<a href="#idx" target="_self">Index </a>
### <span id="s3">Creating a dataframe from a numpy array</span>

In [11]:
np_data = np.array([[3.7, 2.5, 8.9], [2.0, 4.5, 3.2]])
np_data

array([[3.7, 2.5, 8.9],
       [2. , 4.5, 3.2]])

In [12]:
df_np = pd.DataFrame({'Column1':np_data[:,0],'Column2':np_data[:,2]})
df_np

   Column1  Column2
0      3.7      8.9
1      2.0      3.2

In [13]:
df_np = pd.DataFrame(np_data)
df_np

     0    1    2
0  3.7  2.5  8.9
1  2.0  4.5  3.2

#### <span style="color:red" id="t3">Task 3</span>
Create a numpy array using np.random.rand(). Upon creating align it to the dataframe.

In [14]:
# help(np.random.rand)

In [15]:
np.random.seed(42)
np_random = np.random.rand(50,4)
np_random[0:5]

array([[0.37454012, 0.95071431, 0.73199394, 0.59865848],
       [0.15601864, 0.15599452, 0.05808361, 0.86617615],
       [0.60111501, 0.70807258, 0.02058449, 0.96990985],
       [0.83244264, 0.21233911, 0.18182497, 0.18340451],
       [0.30424224, 0.52475643, 0.43194502, 0.29122914]])

In [16]:
df_np_random = pd.DataFrame(np_random)
# df_np_random
display(df_np_random.head())
print(df_np_random.shape)

          0         1         2         3
0  0.374540  0.950714  0.731994  0.598658
1  0.156019  0.155995  0.058084  0.866176
2  0.601115  0.708073  0.020584  0.969910
3  0.832443  0.212339  0.181825  0.183405
4  0.304242  0.524756  0.431945  0.291229

(50, 4)

<a href="#idx" target="_self">Index </a>
### <span id="s4">4. Read a comma-separated values (csv) file into DataFrame.</span>

In [17]:
df_csv = pd.read_csv(r'..\datasets\heart.csv')
display(df_csv.head())
print(df_csv.shape)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

(303, 14)

In [18]:
df_csv.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [19]:
df_csv.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

#### <span style="color:red" id="t4">Task 4</span>
Read data from "Diamonds" dataset. <br />
Drop the unknown column. <br /> 
Set column "table" as the index in the dataframe. <br />

In [20]:
diamonds = pd.read_csv(r'../datasets/diamonds.csv')
diamonds

,Unnamed: 0,carat,cut,color,clarity,depth,table,price,x,y,z
0,1,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43
1,2,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31
2,3,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31
3,4,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63
4,5,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75
...,...,...,...,...,...,...,...,...,...,...,...
53935,53936,0.72,Ideal,D,SI1,60.8,57.0,2757,5.75,5.76,3.50
53936,53937,0.72,Good,D,SI1,63.1,55.0,2757,5.69,5.75,3.61
53937,53938,0.70,Very Good,D,SI1,62.8,60.0,2757,5.66,5.68,3.56
53938,53939,0.86,Premium,H,SI2,61.0,58.0,2757,6.15,6.12,3.74
53939,53940,0.75,Ideal,D,SI2,62.2,55.0,2757,5.83,5.87,3.64

In [21]:
diamonds = diamonds.iloc[:,1:]
diamonds

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [22]:
diamonds.set_index('table')

       carat        cut color clarity  depth  price     x     y     z
table
55.0    0.23      Ideal     E     SI2   61.5    326  3.95  3.98  2.43
61.0    0.21    Premium     E     SI1   59.8    326  3.89  3.84  2.31
65.0    0.23       Good     E     VS1   56.9    327  4.05  4.07  2.31
58.0    0.29    Premium     I     VS2   62.4    334  4.20  4.23  2.63
58.0    0.31       Good     J     SI2   63.3    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...   ...   ...   ...
57.0    0.72      Ideal     D     SI1   60.8   2757  5.75  5.76  3.50
55.0    0.72       Good     D     SI1   63.1   2757  5.69  5.75  3.61
60.0    0.70  Very Good     D     SI1   62.8   2757  5.66  5.68  3.56
58.0    0.86    Premium     H     SI2   61.0   2757  6.15  6.12  3.74
55.0    0.75      Ideal     D     SI2   62.2   2757  5.83  5.87  3.64

[53940 rows x 9 columns]

<a href="#idx" target="_self">Index </a>
### <span id="s5">5.Reading file from SQLite Databases using Python or Pandas into DataFrame</span>

In [23]:
import sqlite3

In [24]:
cnx = sqlite3.connect(r'../datasets/database.sqlite')

In [25]:
cnx

In [26]:
all_tables = pd.read_sql_query('SELECT * FROM sqlite_master where type="table"',cnx)
all_tables

,type,name,tbl_name,rootpage,sql
0,table,Player,Player,2,CREATE TABLE [Player] (\n\t[Player_Id]\tintege...
1,table,Extra_Runs,Extra_Runs,3,CREATE TABLE [Extra_Runs] (\n\t[Match_Id]\tint...
2,table,Batsman_Scored,Batsman_Scored,7,CREATE TABLE [Batsman_Scored] (\n\t[Match_Id]\...
3,table,Batting_Style,Batting_Style,10,CREATE TABLE [Batting_Style] (\n\t[Batting_Id]...
4,table,Bowling_Style,Bowling_Style,11,CREATE TABLE [Bowling_Style] (\n\t[Bowling_Id]...
5,table,Country,Country,12,CREATE TABLE [Country] (\n\t[Country_Id]\tinte...
6,table,Season,Season,14,CREATE TABLE [Season] (\n\t[Season_Id]\tintege...
7,table,City,City,15,CREATE TABLE [City] (\n\t[City_Id]\tinteger NO...
8,table,Outcome,Outcome,16,CREATE TABLE [Outcome] (\n\t[Outcome_Id]\tinte...
9,table,Win_By,Win_By,17,CREATE TABLE [Win_By] (\n\t[Win_Id]\tinteger N...
10,table,Wicket_Taken,Wicket_Taken,18,CREATE TABLE [Wicket_Taken] (\n\t[Match_Id]\ti...
11,table,Venue,Venue,21,CREATE TABLE [Venue] (\n\t[Venue_Id]\tinteger ...
12,table,Extra_Type,Extra_Type,23,CREATE TABLE [Extra_Type] (\n\t[Extra_Id]\tint...
13,table,Out_Type,Out_Type,24,CREATE TABLE [Out_Type] (\n\t[Out_Id]\tinteger...
14,table,Toss_Decision,Toss_Decision,25,CREATE TABLE [Toss_Decision] (\n\t[Toss_Id]\ti...
15,table,Umpire,Umpire,26,CREATE TABLE [Umpire] (\n\t[Umpire_Id]\tintege...
16,table,Team,Team,27,CREATE TABLE [Team] (\n\t[Team_Id]\tinteger NO...
17,table,Ball_by_Ball,Ball_by_Ball,28,CREATE TABLE [Ball_by_Ball] (\n\t[Match_Id]\ti...
18,table,sysdiagrams,sysdiagrams,31,CREATE TABLE [sysdiagrams] (\n\t[name]\tnvarch...
19,table,sqlite_sequence,sqlite_sequence,32,"CREATE TABLE sqlite_sequence(name,seq)"
20,table,Match,Match,34,CREATE TABLE [Match] (\n\t[Match_Id]\tinteger ...
21,table,Rolee,Rolee,36,CREATE TABLE [Rolee] (\n\t[Role_Id]\tinteger N...
22,table,Player_Match,Player_Match,37,CREATE TABLE [Player_Match] (\n\t[Match_Id]\ti...

In [27]:
# df  = pd.read_csv(r'E:\SupervisedLearning\datasets\african_crises.csv')


# df.head()

# df['case'].unique()

# sns.distplot(df['case'])

# df.head(-5)

# # help(df)

# df.info()

# df.describe(include='object')

# df.describe()

# # help(df)

# df.info()

# df.shape

# df.columnss

# ### 3 class task

# ramen = pd.read_csv(r'E:\SupervisedLearning\datasets\ramen-ratings.csv')

# ramen.head()

# ramen.info()

# ramen.describe()

# ramen.shape

# ramen.describe(include='all')

In [28]:
teams = pd.read_sql(""" SELECT *
                          FROM country
                    """,
                   cnx)
teams

    Country_Id  Country_Name
0            1         India
1            2  South Africa
2            3         U.A.E
3            4   New Zealand
4            5     Australia
5            6      Pakistan
6            7     Sri Lanka
7            8   West Indies
8            9     Zimbabwea
9           10       England
10          11    Bangladesh
11          12   Netherlands

#### <span style="color:red" id="t5">Task 5</span>
Using the database sqlite file for "World Development Indicators" , retrive the data for table "Country" restricting based on CountryCode = 'IND'.

In [29]:
wdiConn = sqlite3.connect(r'../datasets/wdi/database.sqlite')
wdiConn

In [30]:
all_tables = pd.read_sql_query('SELECT * FROM sqlite_master where type="table"',wdiConn)
all_tables

,type,name,tbl_name,rootpage,sql
0,table,Country,Country,2,"CREATE TABLE Country (\n CountryCode TEXT,\..."
1,table,CountryNotes,CountryNotes,186,CREATE TABLE CountryNotes (\n Countrycode T...
2,table,Series,Series,948,"CREATE TABLE Series (\n SeriesCode TEXT,\n ..."
3,table,Indicators,Indicators,4448,CREATE TABLE Indicators (\n CountryName TEX...
4,table,SeriesNotes,SeriesNotes,1317550,CREATE TABLE SeriesNotes (\n Seriescode TEX...
5,table,Footnotes,Footnotes,1317587,CREATE TABLE Footnotes (\n Countrycode TEXT...

In [31]:
countries = pd.read_sql(""" SELECT * FROM COUNTRY """,wdiConn)
countries

,CountryCode,ShortName,TableName,LongName,Alpha2Code,CurrencyUnit,SpecialNotes,Region,IncomeGroup,Wb2Code,...,GovernmentAccountingConcept,ImfDataDisseminationStandard,LatestPopulationCensus,LatestHouseholdSurvey,SourceOfMostRecentIncomeAndExpenditureData,VitalRegistrationComplete,LatestAgriculturalCensus,LatestIndustrialData,LatestTradeData,LatestWaterWithdrawalData
0,AFG,Afghanistan,Afghanistan,Islamic State of Afghanistan,AF,Afghan afghani,Fiscal year end: March 20; reporting period fo...,South Asia,Low income,AF,...,Consolidated central government,General Data Dissemination System (GDDS),1979,"Multiple Indicator Cluster Survey (MICS), 2010/11","Integrated household survey (IHS), 2008",,2013/14,,2013,2000
1,ALB,Albania,Albania,Republic of Albania,AL,Albanian lek,,Europe & Central Asia,Upper middle income,AL,...,Budgetary central government,General Data Dissemination System (GDDS),2011,"Demographic and Health Survey (DHS), 2008/09",Living Standards Measurement Study Survey (LSM...,Yes,2012,2011,2013,2006
2,DZA,Algeria,Algeria,People's Democratic Republic of Algeria,DZ,Algerian dinar,,Middle East & North Africa,Upper middle income,DZ,...,Budgetary central government,General Data Dissemination System (GDDS),2008,"Multiple Indicator Cluster Survey (MICS), 2012","Integrated household survey (IHS), 1995",,,2010,2013,2001
3,ASM,American Samoa,American Samoa,American Samoa,AS,U.S. dollar,,East Asia & Pacific,Upper middle income,AS,...,,,2010,,,Yes,2007,,,
4,ADO,Andorra,Andorra,Principality of Andorra,AD,Euro,,Europe & Central Asia,High income: nonOECD,AD,...,,,2011. Population data compiled from administra...,,,Yes,,,2006,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
242,WBG,West Bank and Gaza,West Bank and Gaza,West Bank and Gaza,PS,Israeli new shekel,The new base year is 2004.,Middle East & North Africa,Lower middle income,GZ,...,Budgetary central government,Special Data Dissemination Standard (SDDS),2007,"Multiple Indicator Cluster Survey (MICS), 2014","Integrated household survey (IHS), 2011",,,2010,,2005
243,WLD,World,World,World,1W,,World aggregate.,,,1W,...,,,,,,,,,,
244,YEM,Yemen,"Yemen, Rep.",Republic of Yemen,YE,Yemeni rial,Based on official government statistics and In...,Middle East & North Africa,Lower middle income,RY,...,Budgetary central government,General Data Dissemination System (GDDS),2004,"Demographic and Health Survey (DHS), 2013","Expenditure survey/budget survey (ES/BS), 2005",,,2009,2013,2005
245,ZMB,Zambia,Zambia,Republic of Zambia,ZM,New Zambian kwacha,The new base year is 2010. National accounts d...,Sub-Saharan Africa,Lower middle income,ZM,...,Budgetary central government,General Data Dissemination System (GDDS),2010,"Demographic and Health Survey (DHS), 2013/14","Integrated household survey (IHS), 2010",,2010. Population and Housing Census.,,2013,2002
246,ZWE,Zimbabwe,Zimbabwe,Republic of Zimbabwe,ZW,U.S. dollar,Fiscal year end: June 30; reporting period for...,Sub-Saharan Africa,Low income,ZW,...,Consolidated central government,General Data Dissemination System (GDDS),2012,"Multiple Indicator Cluster Survey (MICS), 2014","Integrated household survey (IHS), 2011/12",,,,2013,2002

In [32]:
india = pd.read_sql(""" SELECT * FROM COUNTRY WHERE CountryCode = 'IND' """,wdiConn)
india

,CountryCode,ShortName,TableName,LongName,Alpha2Code,CurrencyUnit,SpecialNotes,Region,IncomeGroup,Wb2Code,...,GovernmentAccountingConcept,ImfDataDisseminationStandard,LatestPopulationCensus,LatestHouseholdSurvey,SourceOfMostRecentIncomeAndExpenditureData,VitalRegistrationComplete,LatestAgriculturalCensus,LatestIndustrialData,LatestTradeData,LatestWaterWithdrawalData
0,IND,India,India,Republic of India,IN,Indian rupee,Fiscal year end: March 31; reporting period fo...,South Asia,Lower middle income,IN,...,Consolidated central government,Special Data Dissemination Standard (SDDS),2011,"Demographic and Health Survey (DHS), 2005/06","Integrated household survey (IHS), 2011/12",,2011,2010,2013,2010

<a href="#idx" target="_self">Index </a>
### <span id="s6">6.Creating DataFrame from a JSON File</span>

JSON, short form for JavaScript Object Notation, is a compact, text based format used to exchange data. This format is common for downloading and storing information from web servers so called Web APIs. JSON is a text-based format similar to Python's dictionary.

In [33]:
##### Reference: https://www.kaggle.com/harupy/pretty-print-json-column

import json
from IPython.display import display, HTML

def pretty_json(data):
    return json.dumps(json.loads(data), indent=2, sort_keys=False)


def pretty_display(df):
    style = """
    <style>
      tr {
        text-align: left !important;
      }
      td {
        font-family: monospace !important;
        white-space: pre !important;
        text-align: left !important;
      }
    </style>
    """
    return display(HTML(df.to_html().replace('},', '},<br>') + style))

In [34]:
# white-space: pre !important;

In [35]:
iris = pd.read_json(r'../datasets/iris.json')
iris

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

In [36]:
monthly_sales = pd.read_json(r'../datasets/monthlySalesbyCategoryMultiple.json')
monthly_sales.dtypes

contents    object
dtype: object

In [37]:
monthly_sales

                                            contents
0  {'category': 'Furniture', 'region': 'West', 'm...
1  {'category': 'Technology', 'region': 'West', '...

In [38]:
from pandas.io.json import json_normalize
contents_df = json_normalize(data = monthly_sales.contents)
contents_df.head()

     category region                                       monthlySales
0   Furniture   West  [{'month': 20130101, 'sales': 38}, {'month': 2...
1  Technology   West  [{'month': 20130101, 'sales': 54}, {'month': 2...

In [39]:
pretty_display(contents_df)